/**
企业发放的奖金根据利润提成。利润低于或等于10万元时，
奖金可提10%；利润高于10万元，低于或等于20万元时，
高于10万元的部分，可提成7.5%；高于20万，低于或等于40万时，
高于20万元的部分，可提成5%；高于40万，低于或等于60万时，
高于40万元的部分，可提成3%；高于60万，低于或等于100万时，
高于60万元的部分，可提成1.5%，高于100万元时，超过100万元的部分按1%提成，
在程序中设定一个变量为当月利润，求应发放奖金总数？
*/

import java.util.Scanner;

public class Demo7{
	
	public static void main(String[] args){
		Scanner sc = new Scanner(System.in);
		System.out.print("请您输入您的利润：");
		int a = sc.nextInt();
		if(a<=100000){
			System.out.print("应发放奖金总数:"+(100000+a*0.1));
		}else if(a>100000&&a<=200000){
			System.out.print("应发放奖金总数:"+(100000+(a-100000)*0.75));
		}else if(a>200000&&a<=400000){
			System.out.print("应发放奖金总数:"+(200000+(a-200000)*0.05));
		}else if(a>400000&&a<=600000){
			System.out.print("应发放奖金总数:"+(400000+(a-400000)*0.03));
		}else if(a>600000&&a<=1000000){
			System.out.print("应发放奖金总数:"+(600000+(a-600000)*0.15));
		}else{
			System.out.print("应发放奖金总数:"+(1000000+(a-1000000)*0.01));
		}
		
	}
}


	